package kg.geektech.les8.game;

import kg.geektech.les8.players.SuperAbility;
import kg.geektech.les8.players.Warrior;
/*


ДЗ на сообразительность:



Создать героя Avrora, которая может входить в режим невидимости на 2 раунда (т.е не получает урон от босса), в тоже время полученный урон в режиме невидимости возвращает боссу в последующих раундах
Добавить игрока Друид, который имеет способность рандомно призывать помощника или создавать копию союзника в виде героя или босса на 1 раунд.


Создать героя TrickyBastard ,  способность которого будет состоять в том, чтобы притвориться мертвым в определенном раунде(из случайного выбора), но в следующем раунде он снова вступает в бой.

Из доп ДЗ нужно реализовать 3х героев на выбор и придумать 1го своего героя и тоже его реализовать.
Дэдлайн 01.10.2020 23:59

https://youtu.be/kOkJ2BKBj8o*/


public class Main {

    public static void main(String[] args) {
        RPG_Game.start();
    }
}
